# Brewfile
# This file contains my brewed pkgs and apps I use.
# Most likely this file hasn't been updated and I have installed other things in the meantime

tap "cjbassi/gotop"
tap "dduan/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/nginx"
tap "homebrew/services"
tap "homebrew/versions"
tap "homebrew/x11"
tap "prisma/prisma"
tap "px4/px4"

# these are pkgs i use
# I'm trying to catagorize them
# Dotfiles / EnvConfig
brew "zsh"
brew "antigen"
brew "neovim"
brew "tmux"
# CLI Tools
brew "automake"
brew "autoconf"
brew "cmake"
brew "bat"
brew "curl"
brew "exa" # ls replacement.
brew "fzf" # fuzzy finder
brew "coreutils"
brew "jq"
brew "wget"
brew "wrk"
brew "dnsperf"
brew "git-delta" # git diff pager with syntax highlighting
brew "git-lfs" # large file support
brew "htop"
brew "git-standup" # generates list of my commits of the last day
brew "mercurial" # Facebooks VCS
# Language Tooling
brew "python", link: false
brew "ant"
brew "cocoapods"
brew "go"
brew "elixir"
brew "shellcheck"
brew "rustup-init"
brew "sbt"
brew "gcc"
# Configmanagement
brew "ansible"
# Cloud things
brew "awscli"
brew "docker", link: false
brew "docker-compose", link: false
brew "hcloud"
#
brew "bison"
brew "bvi"
brew "libffi"
brew "pixman"
brew "ccat"
brew "ccze"
brew "cflow"
brew "faad2"
brew "libogg"
brew "libvorbis"
brew "mad"
brew "mp4v2"
brew "cmus"
brew "colordiff"
brew "cppcheck"
brew "cvs"
brew "deja-gnu"
brew "dfu-util"
brew "dtach"
brew "ec2-ami-tools"
brew "gd"
brew "glances"
brew "glew"
brew "gnupg", link: false
brew "gnuplot"
brew "goaccess"
brew "gobject-introspection"
brew "sdl2"
brew "gource"
brew "grc"
brew "hexedit"
brew "highlight"
brew "little-cms2"
brew "imagemagick"
brew "jasper"
brew "lcov"
brew "libftdi"
brew "libgphoto2"
brew "libicns"
brew "libzip"
brew "libzzip"
brew "lsusb"
brew "makedepend"
brew "mkcert"
brew "mosh"
brew "mtr"
brew "neofetch"
brew "net-snmp"
brew "nmap"
brew "node"
brew "ocaml"
brew "p7zip"
brew "pandoc"
brew "pipes-sh"
brew "rclone"
brew "rdesktop"
brew "redis"
brew "rename"
brew "rig"
brew "sane-backends"
brew "screenfetch"
brew "sdl"
brew "sdl_image"
brew "shpotify"
brew "sk"
brew "socat"
brew "speedtest-cli"
brew "ssh-copy-id", link: true
brew "startup-notification"
brew "stunnel"
brew "swig"
brew "tailor"
brew "tig"
brew "vim"
brew "watchexec"
brew "wine"
brew "yajl"
brew "yarn"
brew "zlib"
brew "cjbassi/gotop/gotop"
brew "dduan/formulae/tre"
brew "homebrew/nginx/nginx-full"

# Casks are precompiled apps.
cask "alacritty"
cask "font-hack-nerd-font"
cask "fritzing"
cask "google-chrome"
cask "mactex"
cask "ngrok"
cask "qlcolorcode"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-pat"
cask "soundcast"
cask "soundflower"
cask "swimat"
cask "hammerspoon"
cask "obsidian"
cask "telegram"
