# Brewfile
# This file contains my brewed pkgs and apps I use.
# Most likely this file hasn't been updated and I have installed other things in the meantime

tap "cjbassi/gotop"
tap "dduan/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "px4/px4"

# these are pkgs i use
# I'm trying to catagorize them
# Dotfiles / EnvConfig
brew "zsh"
brew "antigen"
brew "neovim"
brew "tmux"
# CLI Tools
brew "automake"
brew "autoconf"
brew "cmake"
brew "bat"
brew "curl"
brew "exa" # ls replacement.
brew "fd" # Find implemented in Rust
brew "coreutils"
brew "jq"
brew "wget"
brew "wrk"
brew "dnsperf"
brew "git-delta" # git diff pager with syntax highlighting
brew "git-lfs" # large file support
brew "htop"
brew "git-standup" # generates list of my commits of the last day
brew "mercurial" # Facebooks VCS
brew "cjbassi/gotop/gotop"
brew "dduan/formulae/tre"
brew "gnuplot"
brew "hexedit"
brew "imagemagick"
brew "dfu-util"
brew "dtach"
brew "gnupg", link: false
brew "grc"
brew "mtr"
brew "lsusb"
brew "rename"
brew "net-snmp"
brew "nmap"
brew "pandoc"
brew "pipes-sh"
brew "rclone"
brew "p7zip"
brew "screenfetch"
brew "sk"
brew "socat"
brew "ssh-copy-id", link: true
brew "stunnel"
brew "tig"
brew "watchexec"
# Language Tooling
brew "lcov"
brew "python", link: false
brew "go"
brew "elixir"
brew "shellcheck"
brew "rustup-init"
brew "gcc"
brew "node"
brew "yarn"
# Configmanagement
brew "ansible"
# Cloud things
brew "azure-cli"
brew "awscli"
brew "docker", link: false
brew "docker-compose", link: false
brew "hcloud"
brew "mkcert"

# Casks are precompiled apps.
cask "alacritty"
cask "font-hack-nerd-font"
cask "fritzing"
cask "google-chrome"
cask "mactex"
cask "ngrok"
cask "qlcolorcode"
cask "qlstephen"
cask "quicklook-json"
cask "quicklook-pat"
cask "soundcast"
cask "soundflower"
cask "swimat"
cask "hammerspoon"
cask "obsidian"
cask "telegram"
cask "discord"
cask "1password"

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

